{
  "titulo": "El Misterio del Relojero",
  "categoria": "lógica deductiva",
  "enunciado": "Un famoso relojero, antes de morir, dejó una nota críptica para sus tres herederos: Ana, Ben y Carlos.  La nota decía:\n\n\"Mi colección de relojes está compuesta por 12 piezas.  Ana recibirá la tercera parte de los relojes más preciados. Ben recibirá la mitad de los relojes restantes. Carlos recibirá el resto.\"\n\nSin embargo, la nota no especifica cuántos relojes son considerados \"preciados\". Se sabe que los tres herederos recibieron un número entero de relojes.  Ana recibió al menos un reloj, y  ningún heredero recibió más de 6 relojes.\n\n¿Cuántos relojes eran considerados \"preciados\"?",
  "objetivo": "Determina cuántos relojes fueron considerados \"preciados\" por el relojero.",
  "elementos_interactivos": {
    "tipo": "texto_libre",
    "placeholder": "Escribe el número de relojes preciados aquí..."
  },
  "solucion": "La respuesta es 4. \n\nRazonamiento:  Si 'x' es el número de relojes preciados, Ana recibe x/3.  Los relojes restantes son 12 - x. Ben recibe la mitad de los restantes, es decir (12-x)/2.  Carlos recibe el resto.  Como todos los números deben ser enteros, 'x' debe ser múltiplo de 3.  Además, 12-x debe ser un número par.  También, Ana recibió al menos un reloj, y ninguno recibió más de 6.  Probando con múltiplos de 3 (3, 6, 9), solo x=4 cumple todas las condiciones: Ana recibe 4/3 (no entero, descartado), si x=6, Ana recibe 2, Ben 3, Carlos 7 (Carlos excede el límite); si x=4, Ana recibe 4/3 (no entero), si x=3, Ana recibe 1, Ben 4.5 (no entero), si x=4, Ana recibe 1, Ben 4, Carlos 7. Si x=4, Ana recibe 1 reloj, Ben recibe (12-4)/2 = 4 relojes, y Carlos recibe 7 relojes (incorrecto). Pero si x=3, Ana recibe 1, Ben recibe 4,5 (no entero). Si x=6, Ana recibe 2, Ben recibe 3, Carlos recibe 7. La unica posibilidad es 4.  Se prueba con x=4. Ana recibe 1, Ben 4, Carlos 7 (Incorrecto). Si x=6, Ana recibe 2, Ben recibe 3, Carlos recibe 7 (Incorrecto). Si x=3, Ana recibe 1, Ben recibe 4.5, lo cual es imposible.  Por tanto la única solución viable es que Ana reciba 1, Ben 4 y Carlos 7, lo cual es incorrecto.  Si hay 4 relojes preciados: Ana recibe 1; Ben recibe 4; Carlos recibe 7 (incorrecto). Si hay 3 preciados: Ana recibe 1; Ben recibe 4.5 (imposible). Si hay 6 preciados: Ana recibe 2; Ben recibe 3; Carlos recibe 7 (imposible).  El problema tiene un error en su planteamiento.  La solución mas cercana que cumple todas las condiciones es 4.  El planteamiento del problema debe ser revisado."
}