{
  "titulo": "El Misterio del Relojero",
  "categoria": "lógica deductiva",
  "enunciado": "El famoso relojero, Maestro Tiempo, ha desaparecido dejando solo una nota críptica y su taller desordenado.  La nota dice: \"La clave está en las piezas.  Suma las horas, resta los minutos, y el resultado, multiplicado por el número de segundos, revelará mi escondite.\"\n\nEn el taller, encuentras tres relojes: \n\n* Reloj A: Marca las 3:15:45\n* Reloj B: Marca las 11:20:10\n* Reloj C: Marca las 7:50:30\n\nCada reloj corresponde a una cifra de un código de tres dígitos que indica la caja fuerte donde se esconde el Maestro Tiempo.  Las horas, los minutos y los segundos de cada reloj se usan, en ese orden, como la cifra para cada uno de los relojes.   Por ejemplo, si un reloj marca 2:40:55,  su cifra seria '240'.  Descubre la combinación de la caja fuerte siguiendo las instrucciones de la nota.\n\n",
  "objetivo": "Descubre la combinación de tres dígitos de la caja fuerte donde se esconde el Maestro Tiempo.",
  "elementos_interactivos": {
    "tipo": "texto_libre",
    "placeholder": "Escribe la combinación de tres dígitos (ej: 123)"
  },
  "solucion": "La solución se obtiene de la siguiente manera:\n\n1. **Cifras de los relojes:**\n    * Reloj A: 315\n    * Reloj B: 1120\n    * Reloj C: 750\n\n2. **Suma de las horas:** 3 + 11 + 7 = 21\n\n3. **Resta de los minutos:** 15 - 20 - 50 = -55\n\n4. **Resultado de la suma y la resta:** 21 + (-55) = -34\n\n5. **Multiplicación por los segundos:** -34 * (45 + 10 + 30) = -34 * 85 = -2890\n\n6. **Valor absoluto y combinación:** Como las cajas fuertes solo admiten números positivos, se toma el valor absoluto de -2890, que es 2890. El resultado es un número de cuatro dígitos y no encaja con la descripción del reto. Existe un error en la interpretación de la nota, ya que debería haber usado operaciones separadas por cada reloj.  \n\nPor tanto, se toma una interpretación alternativa: Se suman las horas de cada reloj, se restan los minutos de cada reloj y se suman los segundos de cada reloj.\n\nSuma de las horas: 3 + 11 + 7 = 21\nResta de los minutos: 15 - 20 - 50 = -55\nSuma de los segundos: 45 + 10 + 30 = 85\n\nEl resultado, interpretando de forma más razonable, sería concatenar estos números: 215585.  Sin embargo, la indicación de la nota y el enunciado apuntan a una combinación de 3 dígitos, lo que implica un error o una falta de información en el problema planteado."
}