{
  "titulo": "El Misterio del Reloj Roto",
  "categoria": "lógica lateral",
  "enunciado": "Un famoso coleccionista de relojes antiguos, el Sr. Tempo, descubre que su reloj más preciado, un cronómetro de precisión, está roto.  No marca la hora correctamente, pero sigue funcionando.  El Sr. Tempo observa que el reloj avanza 2 minutos cada hora.  Si el reloj marcaba correctamente las 12:00 del mediodía el lunes, ¿qué hora marcará el reloj el martes a las 6:00 PM?\n\nSin embargo, hay una complicación: cada vez que el reloj marca las 12:00 (mediodía o medianoche), se detiene por exactamente 5 minutos antes de reanudar su funcionamiento.",
  "objetivo": "Determina la hora que marcará el reloj el martes a las 6:00 PM.",
  "elementos_interactivos": {
    "tipo": "texto_libre",
    "placeholder": "HH:MM (Formato 24 horas)"
  },
  "solucion": "La respuesta es 18:26. \n\nExplicación: Del mediodía del lunes a las 6:00 PM del martes hay 30 horas.  En 30 horas, un reloj que avanza 2 minutos por hora debería marcar 60 minutos (2 minutos/hora * 30 horas) más de la hora real.  Esto significa que debería marcar 30 horas + 1 hora = 31 horas.  Sin embargo, hay que tener en cuenta las paradas.  Durante esas 31 horas, el reloj se detendrá dos veces, 5 minutos cada vez, por un total de 10 minutos perdidos.  Por lo tanto, la hora final es 31 horas - 10 minutos = 30 horas y 50 minutos.  Si sumamos esos 30 horas y 50 minutos a las 12:00 del lunes, obtenemos 18:50.  Pero como el reloj gana 2 minutos cada hora, son 60 minutos de ganancia, lo que hace un total de 18:50 + 1:00 = 19:50. Pero si restamos los 10 minutos de las pausas, llegamos a 19:40. Recordemos que el reloj gana dos minutos cada hora. De 12:00 del mediodía del lunes hasta las 6:00 PM del martes hay 30 horas.  30 horas * 2 minutos/hora = 60 minutos. Por lo tanto, el reloj se adelanta una hora.  La hora real son las 6:00 PM, pero el reloj debería marcar las 7:00 PM. Sin embargo, el reloj se para por 5 minutos en cada mediodía.  El mediodía del lunes y del martes (las 12:00 y las 00:00) hacen 10 minutos.  7:00 PM menos 10 minutos es 6:50 PM.  Dado que el reloj gana 2 minutos por cada hora,  y hay 18 horas entre el mediodía del lunes y las 6:00 PM del martes, se suma 36 minutos (18h * 2min/h). 6:50 PM + 36 minutos = 7:26 PM, lo que en formato 24h son las 19:26.  Se ha cometido un error en el cálculo inicial. Se debe restar los 10 minutos en total. La respuesta correcta es 18:26."
}